app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data): User
    {

        $documentTypes = DB::table('document_types')
            ->select('id')
            ->where('name',  $data['document_type'])
            ->get();

        $countries = DB::table('countries')
            ->select('id')
            ->where('name', '=', $data['country'])
            ->get();

        $user = new User();
        $user->name = $data['name'];
        $user->last_name = $data['last_name'];
        $user->id_document_type = $documentTypes;
        $user->document = $data['document'];
        $user->id_country = $countries[0]->id;
        $user->address = $data['address'];
        $user->phone_number = $data['phone_number'];
        $user->email = $data['email'];
        $user->password = Hash::make($data['password']);
        $user->save();
---
select `id` from `document_types` where `name` = 'Cedula de Ciudadania'
select `id` from `countries` where `name` = 'Colombia'
insert into `users` (`name`, `last_name`, `id_document_type`, `document`, `id_country`, `address`, `phone_number`, `email`, `password`, `updated_at`, `created_at`) values ('JUAN DIEGO', 'GARCIA RICO', '[{\"id\":1}]', '1039695125', 1, 'CALLE 48C # 65A - 52', '3207130808', 'juandiego11116@gmail.com', '$2y$10$83aCkoNUXO0V0bZ1yDJ62OuclfdEpC256aBfd2x5N7BJTTXg80/UW', '2022-05-18 21:49:59', '2022-05-18 21:49:59')