app/Http/Controllers/Api/ProductController.php

select * from `products`
---
    public function index(): Collection
    {
        $articulos = Product::all();

select `id` from `categories` where `name` = '2' or `id` = '2'
---
    public function store(Request $request): Product
    {
        $request->validate([
            'name' => 'required',
            'price' => 'required',
            'stock_number' => 'required',
            'id_category' => 'required',
            'description' => 'required',
            'photo' => 'required',
            'visible' => 'required',

        ]);
        $category = DB::table('categories')
            ->select('id')
            ->where('name', '=', $request->id_category)
            ->orWhere('id', '=', $request->id_category)
            ->get();

insert into `products` (`name`, `price`, `stock_number`, `id_category`, `description`, `photo`, `visible`, `updated_at`, `created_at`) values ('Toronja', '2', '150', 2, 'Qwerty', 'dc7b09bb028eab43f001a962256b7dac.png', 0, '2022-05-16 03:47:21', '2022-05-16 03:47:21')
---
        $product->description = $request->input('description');
        $product->photo = $request->input('photo');
        $product->visible = $visible;
        $product->save();