app/Http/Controllers/CartController.php

    public function store(Request $request): RedirectResponse
    {

        $product = Product::find($request->productId);
---
select * from `products` where `products`.`id` = '7' limit 1

    public function show(int $productId)
    {

        $product = Product::with([
            'categories' => function ($query) {
                $query->select('id', 'name');
            }
        ])->where('id', $productId)
            ->get(['id', 'name', 'price', 'photo', 'stock_number', 'visible', 'id_category']);
---
select `id`, `name` from `categories` where `categories`.`id` in (2)
select `id`, `name`, `price`, `photo`, `stock_number`, `visible`, `id_category` from `products` where `id` = 11