app/Http/Controllers/PaymentController.php

    public function store(Request $request): RedirectResponse
    {
        $reference = (string) Str::random(32);
        $data = [];

        foreach (Cart::content() as $product) {
            $data[$product->id] = [
                'amount' => $product->qty,
                'price' => (float) $product->price,
                'subtotal' => (float) $product->price * $product->qty,
            ];
        }

        $paymentGateway = app()->make(PaymentGatewayContract::class);
        $response = $paymentGateway->createSession($reference, $request->total);

        $purchase = new Purchase();
        $purchase->reference = $reference;
        $purchase->total = $request->total;
        $purchase->status = PaymentStatus::PENDING;
        $purchase->id_request = $response['requestId'];
        $purchase->deduct_from_stock = false;
        $purchase->save();
---
insert into `purchases` (`reference`, `total`, `status`, `id_request`, `deduct_from_stock`, `updated_at`, `created_at`) values ('ELRzBiei7xXgwQZazYEloFevE23VpRCi', '117', 'PENDING', 54947, 0, '2022-05-18 21:47:04', '2022-05-18 21:47:04')

    public function finish(Request $request, string $reference): View
    {
        $purchases = DB::table('purchases')
            ->select('id', 'id_request', 'total', 'status', 'deduct_from_stock')
            ->where('reference', $reference)
            ->get();

        $products = DB::table('purchase_product')
            ->join('products', 'purchase_product.product_id', '=', 'products.id')
            ->select('products.id', 'products.name', 'purchase_product.amount', 'purchase_product.subtotal', 'purchase_product.price', 'products.stock_number')
            ->where('purchase_id', $purchases[0]->id)
            ->get();

        $paymentGateway = app()->make(PaymentGatewayContract::class);
        $response = $paymentGateway->createSessionConsult($purchases[0]->id_request);

        DB::table('purchases')
            ->select('status')
            ->where('id_request', 'LIKE', $response['requestId'])
            ->update(['status' => $response['status']['status']]);

        if (($response['status']['status'] == PaymentStatus::APPROVED) and ($purchases[0]->deduct_from_stock == false)) {
            $i = 0;

            foreach ($products as $product) {
                DB::table('products')
                    ->select('stock_number')
                    ->where('id', $request['id_product'])
                    ->update(['stock_number' => $products[$i]->stock_number - $products[$i]->amount]);
                $i++;
            }
            DB::table('purchases')
                ->select('deduct_from_stock')
                ->where('id_request', $response['requestId'])
                ->update(['deduct_from_stock' => true]);
---
select `id`, `id_request`, `total`, `status`, `deduct_from_stock` from `purchases` where `reference` = 'ELRzBiei7xXgwQZazYEloFevE23VpRCi'
select `products`.`id`, `products`.`name`, `purchase_product`.`amount`, `purchase_product`.`subtotal`, `purchase_product`.`price`, `products`.`stock_number` from `purchase_product` inner join `products` on `purchase_product`.`product_id` = `products`.`id` where `purchase_id` = 10
update `purchases` set `status` = 'APPROVED' where `id_request` LIKE 54947
update `products` set `stock_number` = 40 where `id` is null
update `purchases` set `deduct_from_stock` = 1 where `id_request` = 54947