app/Http/Controllers/ProductController.php

select `id`, `name` from `categories` where `categories`.`id` in (1, 2)
select `id`, `name`, `price`, `photo`, `stock_number`, `visible`, `id_category` from `products` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `products`
---
    public function index(Request $request): View
    {
        $text = trim($request->get('text'));
        $products = Product::with([
            'categories' => function ($query) {
                $query->select('id', 'name');
            }
        ])->orderBy('created_at', 'desc')
            ->search($text)
            ->paginate(5, ['id', 'name', 'price', 'photo', 'stock_number', 'visible', 'id_category']);