app/Http/Controllers/PurchaseController.php

    public function show( int $purchase):View
    {

        $purchases = DB::table('purchases')
            ->select('id','id_request', 'total', 'status', 'deduct_from_stock', 'reference')
            ->where('id', $purchase)
            ->get();
        $reference = $purchases[0]->reference;
        $products = DB::table('purchase_product')
            ->join('products', 'purchase_product.product_id', '=', 'products.id')
            ->select('products.id','products.name', 'purchase_product.amount', 'purchase_product.subtotal', 'purchase_product.price', 'products.stock_number')
            ->where('purchase_id',  $purchases[0]->id)
            ->get();
---
select `id`, `id_request`, `total`, `status`, `deduct_from_stock`, `reference` from `purchases` where `id` = 5
select `products`.`id`, `products`.`name`, `purchase_product`.`amount`, `purchase_product`.`subtotal`, `purchase_product`.`price`, `products`.`stock_number` from `purchase_product` inner join `products` on `purchase_product`.`product_id` = `products`.`id` where `purchase_id` = 5