app/Http/Controllers/RolController.php

select `id`, `name` from `roles` where `name` LIKE '%%' order by `name` asc limit 5 offset 0
select count(*) as aggregate from `roles` where `name` LIKE '%%'
---
    public function index(Request $request): View
    {
        $text = trim($request->get('text'));
        $roles = DB::table('roles')
            ->select('id', 'name')
            ->where('name', 'LIKE', '%'.$text.'%')
            ->orderBy('name', 'asc')
            ->paginate(5);