app/Http/Controllers/UserController.php

select `id`, `name`, `last_name`, `email` from `users` where `name` LIKE '%%' or `last_name` LIKE '%%' or `email` LIKE '%%' order by `name` asc limit 5 offset 0
select count(*) as aggregate from `users` where `name` LIKE '%%' or `last_name` LIKE '%%' or `email` LIKE '%%'
---
    public function index(Request $request)
    {
        $text = trim($request->get('text'));
        $users = DB::table('users')
                    ->select('id', 'name', 'last_name', 'email')
                    ->where('name', 'LIKE', '%'.$text.'%')
                    ->orWhere('last_name', 'LIKE', '%'.$text.'%')
                    ->orWhere('email', 'LIKE', '%'.$text.'%')
                    ->orderBy('name', 'asc')
                    ->paginate(5);