app/Http/Controllers/WelcomeController.php

select `id`, `name` from `categories` where `categories`.`id` in (2)
select count(*) as aggregate from `products` where `visible` = 1 and `stock_number` > 0
---
    public function index(): View
    {
        $products = Product::inRandomOrder()
            ->where('visible', true)
            ->where('stock_number', '>', 0)
            ->with([
                'categories' => function ($query) {
                    $query->select('id', 'name');
                }
            ])->paginate(8);